import React from "react";

function Introduction({ startExercise }) {
  return (
    <>
      <p>
        تمرين فهم القراءة هو نوع من التمارين التعليمية، حيث يتم تقديم مقالة أو
        نص للمستخدم للقراءة والفهم. ثم يتعين على المستخدم الإجابة على الأسئلة
        المتعلقة بالنص، مما يختبر فهمه وفهمه للنص. يساعد هذا النوع من التمارين
        على تطوير وتحسين مهارات القراءة، بالإضافة إلى المهارات النقدية
        والتحليلية. ويتم استخدامه عادة في المدارس والمؤسسات التعليمية الأخرى
        لتقييم قدرات الطالب في القراءة والفهم.
        <br></br>
        <br></br>
        "Start Exercise".لبدء تمرين فهم القراءة، يرجى النقر على الزر الذي يقول
      </p>
      <br></br>

      <button className="start_exercise" onClick={startExercise}>
        Start Exercise
      </button>
    </>
  );
}

export default Introduction;
